# 1) რა არის ცვლადი დაწერეთ თქვენი სიტყვებით, განმარტეთ დეტალებში და paint-ში დახაზეთ როგორ წარმოგიდგენიათ.
# 2) შექმენით ცვლადი რომელსაც განაახლებთ 4-ჯერ.
# 3) ძალით დაუშვით შეცდომა ცვლადის სახელის დაწერის დროს და გვერდზე მიუწერეთ რატო აერორებს ცვლადის სახელს.
# 4) კომენტარის სახით დაწერეთ მონაცემთა ტიპები რომლებიც იცით, მიუწერეთ განმარტებაც და მოიფიქრეთ მაგალითებიც.
# 5) შექმენით ცვლადები სადაც შეინახავთ თქვენს სახელს, გვარს, ასაკს და ეს ყველაფერი დაპრინტეთ ერთად
# 6) შექმენით 3 ცვლადები სადაც შეინახავთ სხვადასხვა მოცანემთა ტიპებს და გაიგეთ მატი ტიპი, (type() ფუნქციის გამოყენებით.
# 7) ახსენით type ფუნქცია კომენტარის სახით.
# 8) მომხმარებელს შემოატანინე რამე სიტყვა, ცვლადში შეინახე, შემდეგ კი დაპრინტე მომხმარებლის შემოტანილი ტექსტი.
# 9) მომხმარებელს შემოატანინე თავისი სახელი, გვარი და ასაკი, შემდეგ კი გრძელი წინადადებით დაპრინტეთ: [სახელი] [გვარი] არის [ასაკი] წლის. 
# 10) კომენტარის სახით დაწერეთ როგორ გადავიყვანოთ მონაცემი სხვადასხვა მონაცემთა ტიპებში, (მაგ: ინტეჯერი სტრინგად და ა.შ)
# 11) მომხმარებელს შემოატანინე თავისი სახელი და შეადარე უდრის თუ არა მისი სახელი თქვენ სახელს.
# 12) კომენტარის სახით დაწერეთ და განმარტეთ თქვენი სიტყვებით ლოგიკური ოპერატორები.
# 13) მომხმარებელს შემოატანინე თავისი სახელი და გვარი, შემდეგ კი შეადარე რომელიმე მაინც თუ არის თქვენი სახელის ან გვარის მსგავსი.
# 14) ყველა მათემატიკურ ოპერატორებზე (+, -, /, *, //, %) გააკეთეთ 5-5 მაგალითი და დაპრინტეთ.
# 15) შექმენით 2 ცვლადი სადაც მომხმარებლის შემოტანილ რიცხვებს იმახსოვრებთ, შემდეგ კი შეადარეთ ისინი ერთმანეთს.
# 16) მომხმარებელს შემოატანინე თავისი სახელი, შემდეგ კი შეაბრუნე for loop-ის გამოყენებით.
# 17) კომენტარის სახით ჩამოწერეთ პირობითი ოპერატორები რა არის.
# 18) მომხმარებელს შემოატანინე ასაკი, თუ ასაკი არის 18-ზე მეტი ან ტოლი, მაშინ დაპრინტეთ რომ არის სრულწლოვანი. თუ შემოიტანა 0-დან 18-მდე მაშინ დაპრინტოს, რომ არასრულწლოვანია. და სხვა შემთხვევაში დაპრინტოს რომ სისტემაში ხარვეზი
# 19) მომხმარებელს შემოატანინე სახელი, დაითვალე სახელებში ასოების რაოდენობა, იმ შემთხვევაში თუ ასოების რაოდენობა არის თქვენი სახელში ასოების რაოდენობის ტოლი, მაშინ დაიბეჭდოს რომ თქვენ სახელებში ერთნაირი დაოდენობის ასოებია. სხვა შემთხვევაში, კარგი სახელია. (count ფუნქცია არ გამოიყენოთ, ლუპით გააკეთეთ)
# 20) მომხმარებელს შემოატანინე რიცხვი და შეამოწმე, თუ რიცხვი ლუწია მაშინ დაპრინტეთ რომ ლუწია, სხვა შემთხვევაში კენტი.
# 21) გააკეთეთ კალკულატორი, სადაც მომხმარებელმა უნდა აირჩიოს რომელი მოქმედება უნდა (+, -, *, /) და შემოიტანოს ორი რიცხვი. შემდეგ კი დაპრინტეთ შედეგი.
# 22) მომხმარებელს ჰკითხე რომელ აკადემიაში სწავლობს. თუ შემოიყვანა რომ სწავლოს გოას აკადემიაში, დაპრინტეთ რომ ის არის ნამდვილი ჩადი და პროგრამისტი. სხვა შემთხვევაში, დაიპრინტოს, რომ შემოუერთდეს გოას.
# 23) ახსენი რას გამოიტანს შედეგად და რატომ False or True და 
# 24) ახსენი რას გამოიტანს შედეგად და რატომ False and True.
# 25) ახსენი რას გამოიტანს შედეგად და რატომ False and (True or True).
# 26) ახსენი რას გამოიტანს შედეგად და რატომ (True and False) or True and True or False.
# 26) გაიგე რა შედეგს გამოიტანს --> False or True and True or False and False or (True and False) და კომენტარის სახით ახსენი რატომ.
# 27) გაიგე რა შედეგს გამოიტანს --> True and (True or False) and False or (True and False) და კომენტარის სახით ახსენი რატომ
# 28) დაწერეთ მარტივი პროგრამა, რომელიც სთხოვს მომხმარებელს შეიყვანოს თავისი სახელი და შემდეგ დაბეჭდოს მისალოცი შეტყობინება მათი სახელის გამოყენებით.
# 29) დაწერეთ პითონის პროგრამა, რომელიც ითვლის მართკუთხედის ფართობს. პროგრამამ უნდა სთხოვოს მომხმარებელს მართკუთხედის სიგანე და სიმაღლე.
# 30) sololearn-ში introduction python-ში მე-2 ქვიზის ჩათვლით გააკეთეთ ყველაფერი. მასალა კარგად გადაიმეორეთ




# 1)
print(" ცვლადი არის ყუთი სადაც ინახება მონაცემები ან მომხმარებლის შეყვანილი ინფორმაცია")

# 2)
user_name = "dato"
user_name = 20
user_name = 4.5
user_name = 5

# 3)
# user_name = 1b3     
print("აუცილებლად როდესაც იწერება ასოები უნდა იყოს პრჭყალები")


# 4)
print("მონაცემთა ტიპის მაგალითებია  boool(true folse), int(numbers) , str(names) float(3.4) ") 


# 5)
my_name = "dato"
my_surname = "miribiani"
my_age = 15
print(my_name + my_surname + int(my_age))


# 6)
num =  122
name = "dadaadad"
surname = "datunia"
famale = 3.5
# print(type  ) ????


# 7)
print("type ფუნქცია განსაზღვრავს თუ რა ტიპისაა მონაცემი")

# 8)
input("what color is your bugatti?")
print(input)

# 9)
input("your name?")
input("your surname?")
input("your age?")
input("your hbd?")
print(input)

# 10)
print("i dont know")


# 11)
input("enter your name?")
my_name = "dato"
if input == my_name:
    print("true")


# 12)
print(" ლოგიკური ოპერატორები არის are or not")

# 13)
input("enter your name")
input("enter your surname")
my_surname = "miribiani"
my_name = "dato"
if input == my_name + my_surname :
    print("true")

else:
    print("false")


# 14)

print(10 + 5)
print(-2 + 8)
print(0 + 0)
print(100 + 200)
print(50 + -30)

print(10 - 5)
print(-2 - 8)
print(0 - 0)
print(100 - 200)
print(50 - -30)


print(10 / 5)
print(7 / 2)
print(100 / 25)
print(-15 / 3)
print(0 / 1)


print(10 * 5)
print(-3 * 4)
print(0 * 7)
print(11 * 3)
print(6 * -2)


print(10 // 3)
print(-10 // 3)
print(25 // 4)
print(7 // 2)
print(9 // -2)


print(10 % 3)
print(-10 % 3)
print(25 % 4)
print(7 % 2)
print(9 % -2)


# 15)
num1 = 12 
num2 =  15
if num1 == num2 :
    print("true")
else:
    print("false")

# 16)
print("i dont know")

# 17)
print(" პირობითი ოპერათორებია if esle")

# 18)
input("enter your age")
if input >= 18:
    print("srulwlovani xar") 

if input < 18:
    print("bavshvi xar hahaha")

# 19)
print("i dont know")

# 20)
print("damaviwyda")

# 21)
print("i dont know")


# 22)
input("enter your programers academy")
if input ("goal oriented academy "):
    print("you are chad")

else:
    print("join goa become chad")

# 23)
print("თუ მომხარებელი შეიყვანს თავდაპირველად თავის პაროლს და დააპირებს განმეორებას და იქნება შეცდომა გამოითანს false და თუ შეიყვანა სწორედ მაშინ true ")

# 24)
print("თუ მომხარებელი შეიყვანს თავდაპირველად თავის პაროლს და დააპირებს განმეორებას და იქნება შეცდომა გამოითანს false და თუ შეიყვანა სწორედ მაშინ true ")

# 25)
print("იმ შედეგად რომ ორი სიმართლეა ეს იმას ნიშნავს რო მომხმარებელმა შეიყვანა სწორი მონაცამები  აი მაგალითად შექმნა ახალი პაროლი და სთხოვეს გაიმეოროს ორივეს თუ დაემთხვევა მაშინ უნდა გამოიტანოს 2 სიმართლე და თუ ერთია არასწორი მაშინ გამოიყვანს 1 შეცდომას ")

# 26)
print("True and True – ეს ექვივალენტურია True.False and False – ეს ექვივალენტურია False.True and False – ეს ექვივალენტურია False.")

# 27)
print("i dont know")

# 28)
print("i dont know")

# 29)
print("i dont know")

# 30)
print(" i have not sololearn")
